tcpv2/vpg2.txt

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ws.vpg.viettel.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ws.vpg.viettel.com/" name="VPGWSImpService">
<types></types>
<message name="send">
<part name="data" type="xsd:string"></part>
</message>
<message name="sendResponse">
<part name="return" type="xsd:string"></part>
</message>
<portType name="VPGWS">
<operation name="send">
<input wsam:Action="http://ws.vpg.viettel.com/VPGWS/sendRequest" message="tns:send"></input>
<output wsam:Action="http://ws.vpg.viettel.com/VPGWS/sendResponse" message="tns:sendResponse"></output>
</operation>
</portType>
<binding name="VPGWSImpPortBinding" type="tns:VPGWS">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"></soap:binding>
<operation name="send">
<soap:operation soapAction=""></soap:operation>
<input>
<soap:body use="literal" namespace="http://ws.vpg.viettel.com/"></soap:body>
</input>
<output>
<soap:body use="literal" namespace="http://ws.vpg.viettel.com/"></soap:body>
</output>
</operation>
</binding>
<service name="VPGWSImpService">
<port name="VPGWSImpPort" binding="tns:VPGWSImpPortBinding">
<soap:address location="http://10.120.45.2:8383/vpg.asmx"></soap:address>
</port>
</service>
</definitions>