logs/requests/AIRTIME/HALOTEL-2017-09-2116.txt

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://ws.vpg.viettel.com/">
<SOAP-ENV:Body>
<ns1:send>
<data>&lt;DATA&gt;
&lt;MTI&gt;0200&lt;/MTI&gt;
&lt;MSISDN&gt;0628879500&lt;/MSISDN&gt;
&lt;PROCESS_CODE&gt;000000&lt;/PROCESS_CODE&gt;
&lt;TRANS_AMOUNT&gt;1000&lt;/TRANS_AMOUNT&gt;
&lt;TRANS_TIME&gt;20170921044447&lt;/TRANS_TIME&gt;
&lt;SYSTEM_TRACE&gt;020170921044447&lt;/SYSTEM_TRACE&gt;
&lt;CLIENT_ID&gt;greentel&lt;/CLIENT_ID&gt;
&lt;SIGNATURE&gt;O9WllyZPTEjMKIZBBtR3v09sjidwI9U8AZNOpOz9x64z3Sk4en9ERMw5mfcoiMLRJpPAA5/DixxuDhA0SFoSN6FqnY/lNrm+2vPjZVEOAbtLsBZ4LTzilt+kDuxa59VtzeJBms5VFVsvEWghV8XRpZnNjBu09Ct87rXpDJDrfvM=&lt;/SIGNATURE&gt;&lt;ADD_DATA&gt;&lt;/ADD_DATA&gt;
&lt;/DATA&gt;</data>
</ns1:send>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope> 
